Determines whether this is a primary design option.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool IsPrimary { get; }
  Visual Basic
Public ReadOnly Property IsPrimary As Boolean
	Get
  Visual C++
public:
property bool IsPrimary {
	bool get ();
}
 See Also
  DesignOption Class
  Autodesk.Revit.DB Namespace